case_packing_with_g/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Make sure all utilities know specialised models
libs            (atmosphericModels);

application         MPPICFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             4;

deltaT              0.0001;

writeControl        runTime;

writeInterval       0.1;

purgeWrite          10;

writeFormat         ascii;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       6;

runTimeModifiable   no;

maxAlphaCo          0.5;

functions
{
}


// ************************************************************************* //
