case_packing_with_g/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

X       0.25;
Y       0.05;
Z       5;
Z_neg   -0.05;

vertices
(
    (0. 0. $Z_neg)
    ($X 0. $Z_neg)
    ($X $Y $Z_neg)
    (0. $Y $Z_neg)

    (0. 0. 0)
    ($X 0. 0)
    ($X $Y 0)
    (0. $Y 0)

    (0. 0. $Z)
    ($X 0. $Z)
    ($X $Y $Z)
    (0. $Y $Z)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (32 1 20) simpleGrading (1 1 0.5)
    hex (4 5 6 7 8 9 10 11) (32 1 120) simpleGrading (1 1 100)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
