case_packing_with_g/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    maxCo           0.5;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        k.air           cellPoint;
        epsilon.air     cellPoint;
        omega.air       cellPoint;
        mu.air          cell;
    }

    averagingMethod dual;

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U           semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            917;
    alphaMax        0.75;
}

subModels
{
    particleForces
    {
        ErgunWenYuDrag
        {
            alphac      alpha.air;
        }
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            manualInjection;
            massTotal       0;
            parcelBasisType fixed;
            nParticle       512;
            SOI             0;
            positionsFile   "kinematicCloudPositions";
            U0              (0 0 0);
            sizeDistribution
            {
                type        gamma;
                gammaDistribution
                {
                   alpha        5.0;
                   beta         40.0;
                   meanValue    200e-6;
                   maxValue     620e-6;
                   minValue     20e-6;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            top
            {
                type escape;
            }
            ground
            {
                type rebound;
                e   0.5;
                mu  0.5;
            }
        );
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel explicit;

    explicitCoeffs
    {
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.75;
            pSolid 10.0;
            beta 2.0;
            eps 1.0e-7;
        }
        correctionLimitingMethod
        {
            type absolute;
            e 0.5;
        }
    }

    implicitCoeffs
    {
        alphaMin 0.0001;
        rhoMin 1.0;
        applyLimiting true;
        applyGravity true;
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.75;
            pSolid 5.0;
            beta 2.0;
            eps 1.0e-2;
        }
    }

    dampingModel relaxation;

    relaxationCoeffs
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.75;
            e 0.5;
        }
    }

    isotropyModel stochastic;

    stochasticCoeffs
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.75;
            e 0.5;
        }
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}


// ************************************************************************* //
