case_packing_with_g/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

kappa                0.40;          // (HW:p. 358)
Cmu                  0.09;          // (HW:p. 358)
flowDir              (1 0 0);       // (HW:Fig. 1)
zDir                 (0 0 1);       // (HW:Fig. 1)
z0                   uniform 0.0002;  // (HW:Table 1)
d                    uniform 0.0;


// ************************************************************************* //
