case_packing_with_g/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        //solver           GAMG;
        //smoother         GaussSeidel;
        tolerance        1e-6;
        relTol           0.001;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //solver           GAMG;
        //smoother         GaussSeidel;
        tolerance       1e-06;
        relTol          0.0001;
    }

    "(U|k|epsilon|omega).*Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        //solver        smoothSolver;
        //smoother      GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    kinematicCloud:alpha
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        //solver        GAMG;
        //smoother      GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}


PIMPLE
{
    nNonOrthogonalCorrectors    0;
    nCorrectors                 2;
    nOuterCorrectors            2;
}


relaxationFactors
{
    equations
    {
        U.air                  0.8;
        "(k|epsilon|omega).*"  0.8;
    }
}

cache
{
    grad(U.air);
}


// ************************************************************************* //
