case_packing_with_g/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

samples
{
    type                    sets;
    libs                    (sampling);
    setFormat               raw;
    interpolationScheme     cell;
    fields                  (alpha.air);
    writeControl            writeTime;

    sets
    (
        x_0mPatch
        {
            type        face;
            axis        z;
            start       (0.2 0.025 -0.05);
            end         (0.2 0.025 5);
        }

        x_0mCell
        {
            type        midPoint;
            axis        z;
            start       (0.2 0.025 -0.05);
            end         (0.2 0.025 5);
        }
    );
}


// *********************************************************************** //
